#pragma once
#include <memory>


//===========================================================
/// [機能] Sceneの基底クラスです。
/// ゲームのシーンになるクラスはこれを継承します
//===========================================================
class Scene {
public:
	Scene();
	virtual ~Scene();
	//------------------------------------------------
	///[機能] シーンを開始します
	//------------------------------------------------
	struct NextScene Run();

protected:
	//---------------------------------------------------
	///[機能] シーンに応じた、入力を受け取る処理をします
	//---------------------------------------------------
	virtual void ProcessInput() = 0;
	//---------------------------------------------------
	///[機能] シーンに応じた更新処理を行います
	//---------------------------------------------------
	virtual struct NextScene Update() = 0;
	//---------------------------------------------------
	///[機能] シーンに応じた描画処理を行います
	//---------------------------------------------------
	virtual void Render() = 0;

private:

};